-- --------------------------------------------------------
-- Хост:                         C:\Users\Katya\Downloads\Telegram Desktop\ma.db
-- Версия сервера:               3.44.0
-- Операционная система:         
-- HeidiSQL Версия:              12.6.0.6765
-- --------------------------------------------------------

/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET NAMES  */;
/*!40103 SET @OLD_TIME_ZONE=@@TIME_ZONE */;
/*!40103 SET TIME_ZONE='+00:00' */;
/*!40014 SET @OLD_FOREIGN_KEY_CHECKS=@@FOREIGN_KEY_CHECKS, FOREIGN_KEY_CHECKS=0 */;
/*!40101 SET @OLD_SQL_MODE=@@SQL_MODE, SQL_MODE='NO_AUTO_VALUE_ON_ZERO' */;
/*!40111 SET @OLD_SQL_NOTES=@@SQL_NOTES, SQL_NOTES=0 */;

-- Дамп данных таблицы ma.Dances: 14 rows
/*!40000 ALTER TABLE "Dances" DISABLE KEYS */;
INSERT INTO "Dances" ("Id", "Name", "History", "Scheme", "TypeId", "EpochId", "LevelId", "ChangePartner", "CountOfPairs") VALUES
	(488, 'Мазурка «Мечта» (Mazurka Sognante)', 'Хореограф: Фабио Моллика.
', 'Исходное положение: пары по кругу в закрытой позиции, кавалер спиной в центр.

## 1 часть (8 тактов)

**1-4**. Полтура вальса по линии танца, глиссе, повторить связку против л.т.

**5-8**. Па польки-мазурки по л.т., полтура вальса, повторить связку.

---

## 2 часть (8 тактов)

**1-4**. Балансе за правые руки: друг к другу, друг от друга, глиссе вправо, глиссе влево (встать плечом к плечу).

**5-8**. Шаг вперед с правой ноги, пируэт, аллеманд со сменой мест.

---

## 3 часть (8 тактов)

**1-4**. С внешних ног – 2 падебаск-полонеза по л.т., соло-поворот, встать лицом против л.т.

**5-8**. Pas de côté croisé et pirouette (встать лицом по л.т.), круазе на 2 падебаск-полонезах с продвижением по л.т.

## 4 часть (8 тактов)

---

**1-4**. С внешних ног – 4 па гала по л.т., в конце остаться спиной друг к другу

**5-8**. Стоя спиной друг к другу – балансе по л.т., против л.т., прогрессия: pas de côté croisé et pirouette каждый в свое лево.', 9, 5, 2, 1, 6),
	(489, 'Мазурка «Любовь и вино» (Mazurka Amore e Vino)', 'Хореограф: Фабио Моллика.', 'Исходная позиция: открытые пары лицом по линии танца.

## 1 часть (16 тактов)

**1-4**. 4 pas simple с внешних ног, в конце разворот лицом друг к другу.

**5-6**. Pas de cote каждый в свое право.

**7-8**. Pas de cote каждый в свое лево, в конце закрыться в вальсовую позицию.

**9-12**. Pas simple по линии танца, pas alternative в повороте, повторить.

**13-16**. Pas de cote вправо и влево (повторить 5-8), подать правые руки.


---

## 2 часть (16 тактов)

**17-20**. Правый поворот за 4 pas simple, начиная с левых ног.

**21-22**. Balance друг к другу.

**23-24**. Allemand со сменой мест: дама приходит на внутренний круг. Подать левые руки.

**25-28**. Левый поворот за 4 pas simple, начиная с правых ног.

**29-30**. Pas de cote каждый в свое право (дама всё ещё внутри круга).

**31-32**. Allemand со сменой мест с новым партнером: дама выходит наружу.', 9, 5, 2, 1, 6),
	(490, 'Мазурка «Мусме» (Mazurka La Mousmé, Mazurka La Mousmee)', '', 'Променад в открытой паре по линии танца 4 медленных шага, поворот друг к другу и поклон. Повторить ещё раз.

Променад 6 тактов, повернуться лицом друг к другу, кавалер подаёт правую руку, дама – левую, свободные руки в сторону и вверх.

## 1 фигура:
Голубцы и редова. 1-1-1-3 (3 через приставку, 3 быстрых), 2 полных оборота. Фигура танцуется 4 раза.

---

## 2 фигура: 
Полька-мазурка. В закрытой паре по линии танца глиссе-купе-жете, глиссе-приставить, повторить против линии танца. 1,5 полечных поворота, на 4 такт глиссе-приставить, дама остаётся спиной в круг.

Повторить эту связку ещё раз с новых мест, по линии танца, против линии танца, реверс-полька против линии танца 1,5 оборота, на 4 такт – глиссе-приставить.

---

## 1 фигура: 
повторить 2 раза.

---

## 3 фигура: 
Вальс и реверс-вальс – движение всегда по линии танца: 7+1. Фигура танцуется 4 раза.

---

## 4 фигура: 
Променад в открытой паре. С внешних ног – хоп (голубец вперёд, 2 шага), шассе с внешних ног, батман сзади свободной ногой, перенос её вперёд – батман (6 счётов), повтор с других ног, 4 мазурочных падебаска. Фигура танцуется 4 раза.

---

## 3 фигура: 
Вальс и реверс 7+1. Фигура танцуется 2 раза.

---

## 1 фигура: 
повторить 2 раза.

---

## 2 фигура: 
Полька-мазурка.

---

С этого момента всё танцуется по линии танца.

---

## 5 фигура:
Полька-мазурка в закрытой паре: променад, пол-поворота, променад, пол-поворота (4 такта), 2 полных полечных поворота (4 такта).

Реверс-полька-мазурка в закрытой паре: променад, пол-поворота реверс, променад, пол-поворота реверс (4 такта), 2 полных реверсных полечных поворота (4 такта).

2 редовы, 4 пивота, 2 редовы, пивоты до конца музыки.
', 9, 5, 3, 0, 1),
	(491, 'Мазурка «Ностальгия» (Mazurka Nostalgia)', 'Хореограф: Фабио Моллика, 2007 г.', 'Исходная позиция: в закрытой паре, кавалер спиной к центру.

**1-2**. 2 такта вальса.

**3-4**. Pas de côté каждый в своё право, в конце повернуться через правое плечо.

**5-8**. 4 pas de basque polonaise друг к другу по полукругу, в конце закрыться в пару, кавалер – спиной к центру.

**9-10**. 2 такта вальса.

**11-12**. Pas de côté каждый в своё лево, в конце повернуться через левое плечо.

**13-16**. 4 pas de basque polonaise друг к другу по полукругу, в конце встать в променадную позицию лицом по л.т.

**17-18**. 2 pas glissé по л.т.

**19-20**. Pas de côté croisé (дама проходит налево впереди кавалера, кавалер – направо позади дамы).

**21-22**. 2 pas glissé по л.т.

**23-24**. Pas de côté croisé обратно до своих мест (дама проходит направо впереди кавалера, кавалер – налево позади дамы), в конце закрыться в пару, кавалер – спиной к центру.

**25-28**. 4 такта вальса.

**29-30**. Балансе за правые руки: друг к другу, друг от друга.

**31-32**. Прогрессия: pas de côté каждый в своё право к следующему партнёру.', 9, 5, 2, 1, 6),
	(492, 'Мазурка «Привет из Австрии» (Mazurka Saluti dall’Austria)', 'Хореограф: Фабио Моллика.
', 'Танец рассчитан на любое количество пар, стоящих по кругу.

Исходная позиция: в открытой паре лицом по линии танца.

**1-4**. 4 па глиссе по линии танца, начиная с внешних ног. 4-ый шаг «закрытый» – (на счет «1» – шаг вперед, «2-3» приставка ноги в 1 позицию, «удар каблуками» – по желанию).

**5-8**. Pas de cote croise – смена мест (дама проходит налево впереди кавалера, кавалер – направо позади) и обратно, заканчивая vis-à-vis.

**9-12**. 4 па глиссе с левых ног за правые руки – полный круг.

**13-16**. 4 па глиссе с правых ног за левые руки – полный круг.

**17-20**. Defile: 4 па глиссе по кругу, без контакта руками, лицом друг к другу, в завершении: кавалер спиной по л.т, дама – лицом.

**21-24**. Pas de cote a droite et a gauche – заканчивая в положении dos-a-dos.

**25-28**. Повтор 21-24 тактов, заканчивая vis-a-vis.

**29-32**. Балансе и пируэт – расходясь левыми плечами: дама по линии танца, кавалер против линии танца – к следующему партнеру.', 9, 5, 1, 1, 6),
	(493, 'Мазурка «Сердце женщины» (Mazurka Cuore di Donna)', 'Хореограф: Фабио Моллика, 1993 г.
', 'Исходное положение: в открытой паре лицом по линии танца.

## 1 часть (8 тактов)

**1-4**. 3 па глиссе по линии танца, начиная с внешних ног, 4-ый шаг «закрытый» (на счёт «1» – шаг вперёд, на «2-3» – приставка ноги в 1 позицию, «удар каблуками» – по желанию).

**5-8**. Pas de côté croisé – смена мест (дама проходит налево впереди кавалера, кавалер – направо позади дамы) и обратно, заканчивая vis-à-vis.

---

## 2 часть (8 тактов)

**9-12**. 4 pas simple с левых ног за правые руки – полный круг.

**13-14**. 2 pas simple с правых ног за левые руки – полный круг.

**15-16**. Прогрессия: за 2 pas simple кавалер переходит к следующей даме против линии танца, дама – к следующему кавалеру по линии танца.', 9, 4, 1, 1, 6),
	(494, 'Мазурка «Сицилийская вечерня» (Mazurka Vespri Siciliani, Мазурка «Сицилийский вечер»)', 'Хореограф: Фабио Моллика, 1997 г.
', 'Исходное положение: открытая пара лицом по линии танца.

**1-4**. 4 pas-de-basque polonaise (в конце закрылись в пару: кавалер спиной в центр, дама – лицом).

**5**. 1 па польки-мазурки (Passo semplice).

**6**. 1 па польки (поменялись местами).

**7-8**. Повторить такты 5-6.

**9-10**. 2 Promenade in passo alternato.

**11-12**. 2 такта смена мест (кавалер перед дамой, дама за кавалером поворотом).

**13-14**. 2 Promenade in passo alternato.

**15-16**. 2 такта смена мест (кавалер за дамой поворотом, дама перед кавалером).

**17-20**. 4 pas-de-basque polonaise (в конце закрылись в пару: кавалер спиной в центр, дама – лицом).

**21-24**. 1 такт вальса, Balance каждый в свое вправо, влево, пируэт влево.

**25-28**. 1 такт вальса, Balance каждый в свое вправо, влево, пируэт влево.

**29-30**. 2 такта вальса.

**31-32**. 2 такта pas de cote вправо.', 9, 4, 1, 1, 6),
	(495, 'Мазурка «Тысяча цветов» (Mazurka Mille Fiori)', '', 'Исходная позиция: в закрытой паре, кавалер спиной к центру.

**1-4**. Вальс.

**5-6**. Дама 2 падебаск-полонеза вперед лицом по л.т., кавалер 2 coup de talon (2 голубца) влево, по л.т., лицом к даме.

**7-8**. Алеман – обмен местами за правые руки, дама спиной к кавалеру, в результате кавалер оказался во внешнем кругу, дама – во внутреннем.

**9-10**. Дама 2 падебаск-полонеза вперед лицом по л.т., кавалер 2 coup de talon (2 голубца) вправо, по л.т., лицом к даме.

**11-12**. Алеман.

**13-16**. Вальс.

**17-18**. В раскрытой паре, лицом по л.т. с внешних ног 2 падебаск-полонеза.

**19-20**. 1 тур вальса.

**21-24**. Повторить 17-20.

**25-26**. Позиция «корзиночка», 2 па глиссе в паре, начиная влево.

**27-28**. Отпустить руки; 1 тур левого венского вальса поодиночке.

**29-30**. Позиция «корзиночка», 2 па глиссе в паре, начиная вправо.

**31-32**. Отпустить руки; 1 тур правого венского вальса поодиночке. Повернуться лицом друг к другу.

**33-34**. Па де коте вправо, к следующему партнеру.

**35-36**. Па де коте влево, спина к спине со своим партнером.

**37-38**. Па де коте вправо, лицом к следующему партнеру.

**39-40**. Кавалер проворачивает даму под левой рукой, пара становится в вальсовую позицию, танец повторяется.', 9, 4, 2, 1, 6),
	(496, 'Мазурка «Фата-моргана» (Mazurka Fata Morgana)', 'Хореограф: Tindara Addabbo, 1993 г.', 'Исходное положение: кавалер спиной в центр, дама – лицом, руки в позиции «лодочка».

**1-4**. Pas de côté по л.т., pas de côté против л.т.

**5-7**. Три четверти оборота по часовой стрелке на pas simple с левой ноги.

**8**. Поворот дамы под левой рукой кавалера, закрыться в пару (кавалер спиной по л.т.).

**9-10**. Два шага по л.т. (дама начинает с правой ноги вперёд, кавалер – с левой ноги назад).

**11-12**. Два шага против л.т. (дама начинает с левой ноги назад, кавалер – с правой ноги вперёд).

**13-14**. Два такта вальса, кавалер заканчивает спиной в центр.

**15-16**. Прогрессия: pas de côté вправо.
', 9, 4, 1, 1, 6),
	(497, 'Мазурка «Фру-фру» (Mazurka Frou-Frou)', 'Хореограф: Винченцо Джанноне, из книги Э. Жироде Traité de la Danse, 1899.', 'Исходное положение: в открытой паре, кавалер держит даму за талию правой рукой, дама опирается левой рукой на плечо кавалера.

**1-2**. 2 шага польки-мазурки вперёд.

**3-4**. Вальс.

**5-8**. Повтор тактов 1-4, закончить лицом к партнёру (кавалер спиной в центр) с перекрещенными руками.

**9-10**. 2 шага польки-мазурки по линии танца, оставаясь лицом к партнёру.

**11-12**. 3/4 поворота за правые руки, заканчивая: кавалер лицом по линии танца, дама – спиной по линии танца.

**13-14**. Аллеманд на 1/4 разворота за правые руки (кавалер заканчивает спиной в центр).

**15-16**. Прогрессия: дама делает пируэт через левое плечо против линии танца, кавалер – пируэт на месте через левое плечо.', 9, 3, 1, 1, 6),
	(498, 'Мазурка «Цветы в мае» (Mazurka Fiori di Maggio)', 'Хореограф: Фабио Моллика.
', 'Исходная позиция: в открытой паре лицом по линии танца, дама справа от кавалера.

## 1 часть (16 тактов)

**1-4**. С внешних ног 4 pas glisse alternative (со сменой ног).

**5-8**. Pas de cote в паре по л.т. и обратно (кавалер спиной к центру, дама – лицом).

**9-12**. 4 такта вальса (кавалер заканчивает спиной к центру, на небольшом расстоянии от дамы).

**13-14**. Простая смена (по ч.с., без рук), в конце – довернуться левым плечом к партнеру.

**15-16**. Pas de cote влево (оба партнера расходятся лицом друг у другу, меняясь местами), в конце шага – правая нога накрест вперед и поворот: кавалер – на 360°, дама – на 180°).

---

## 2 часть (16 тактов)

**1-16**. Танец повторяется с начала. В конце второго повтора – прогрессия на повороте в конце pas de cote: дама уходит вперед к следующему кавалеру.
', 9, 4, 1, 1, 6),
	(499, 'Мазурка «Шалость» (Mazurka Lo Sberleffo, Мазурка «Дразнилка»)', 'Хореограф: Фабио Моллика.', 'Исходная позиция: в открытой паре лицом по линии танца.

**1-4**. 3 pas alternative по линии танца, начиная с внешних ног. 4-ый шаг «закрытый» – (на счет «1» – шаг вперед, «2-3» приставка ноги в 1 позицию, «удар каблуками» – по желанию).

**5-6**. Pas de cote croise – смена мест (дама проходит налево впереди кавалера, кавалер направо позади).

**7-8**. Дама двигается по линии танца на pas alternative, кавалер – лицом к ней и боком по л.т. – выполняет pas coup de talon по линии танца.

**9-10**. Дама двигается по линии танца на pas alternative, кавалер – лицом к ней и боком по л.т. – выполняет pas coup de talon против линии танца – к предыдущей даме.

**11-12**. Pas de cote croise – смена мест (дама проходит направо впереди кавалера, кавалер налево позади дамы), заканчивая vis-à-vis.

**13-14**. 2 pas de basque лицом друг к другу: с правой ноги, с левой.

**15-16**. Пируэт на 270° (кавалер – направо, дама – налево). В завершении – кавалер и дама лицом по линии танца.', 9, 5, 1, 0, 1),
	(500, 'Мазурка «Эмансипата» (Mazurka L’Emancipata)', 'Хореограф: Фабио Моллика, 2003 г.
Музыкальный размер: 3/4.', 'Исходное положение: в открытой паре лицом по линии танца.

**1-2**. 2 pas de basque polonaise по л.т. с внешних ног.

**3-4**. Pas de côté друг от друга (дама – вправо, кавалер – влево).

**5-6**. 2 pas de basque polonaise по л.т. с внешних ног (далеко друг от друга).

**7-8**. Pas de côté друг к другу (дама – влево, кавалер – вправо).

**9-10**. Дама – 2 pas de basque polonaise по полукругу влево, чтобы закончить на месте кавалера спиной по л.т., кавалер – pas de côté вправо, чтобы закончить на месте дамы.

**11-12**. Дама – pas de côté влево, кавалер – 2 pas de basque polonaise по полукругу влево.

**13-14**. Дама – 2 pas de basque polonaise, кавалер – pas de côté.

**15-16**. Дама – pas de côté, кавалер – 2 pas de basque polonaise, встать в и.п.

**17-20**. 3 pas simple alternative по л.т. с внешних ног, на 20 такт закрылись в пару.

**21-24**. 4 такта вальса.

**25-28**. Pas de côté по л.т., pas de côté против л.т.

**29-30**. 2 такта вальса.

**31-32**. Прогрессия: pas de côté каждый в своё право.', 9, 5, 1, 1, 6),
	(501, ' Мазурка в пять па (Мазурка в 5 па)', 'Источники изучения: материалы фестиваля «БалКон», Рязань, 2014 г.
Музыкальный размер: 3/4.', 'Исходная позиция: в открытой паре лицом по линии танца, кавалер держит правой рукой левую руку дамы на уровне талии.

**1-4**. Променад – пары идут по кругу зала. Кавалер исполняет с левой pas gala, дама с правой – pas couru.

**5-8**. Обводка дамы против часовой стрелки (кавалер делает на месте шаг с приставкой вправо, влево, вправо, ключ).

**9-12**. Променад.

**13-16**. Кавалер на колено, обводка дамы. На последний такт – ключ кавалера.

**17-20**. Променад.

**21-24**. Pas de bourree, по линии танца Pas Coup de Talon (голубец), шаг, приставка, Pas Coup de Talon, шаг, приставка.

**25-28**. Променад.

**29-32**. Pas de bourree, по линии танца Pas Coup de Talon, шаг, приставка, Pas Coup de Talon, шаг, приставка.

**33-36**. Ключи вправо-влево.

**37-40**. Оборот по ч.с. в закрытой позиции – Tour sur Place. Партнёры держатся правыми руками.

**41-44**. Ключи влево-вправо.

**45-48**. Tour sur Place против часовой стрелки. Партнёры держатся левыми руками.

**49-52**. Боковое Balance 4 раза, начиная по линии танца.

**53-56**. Променад на pas couru.

**57-60**. Боковое Balance 4 раза, начиная по линии танца.

**61-64**. Оборот на месте в открытой позиции против часовой стрелки – кавалер крутится спиной, дама идет лицом на Pas boiteux и смотрит на кавалера «снизу». У кавалера левая 
нога sur le cou de pied назад с прыжком поставил, повернулся с переступанием. Ключ.', 9, 5, 3, 0, 1);
/*!40000 ALTER TABLE "Dances" ENABLE KEYS */;

-- Дамп данных таблицы ma.Video: 13 rows
/*!40000 ALTER TABLE "Video" DISABLE KEYS */;
INSERT INTO "Video" ("Id", "Url", "Name", "DanceId", "MoveId") VALUES
	(564, 'https://vk.com/video16437335_168025039', 'Мазурка «Мечта» (Mazurka Sognante)', 488, NULL),
	(568, 'https://www.youtube.com/watch?v=v5_gjtkO3Og', 'Мазурка «Мусме» (Mazurka La Mousmé, Mazurka La Mousmee)', 490, NULL),
	(569, 'https://youtu.be/BdlstFsimXI?si=OU2fD50JZIah2PY_', 'Мазурка «Любовь и вино» (Mazurka Amore e Vino)', 489, NULL),
	(570, 'https://www.youtube.com/watch?v=Qweza8I00E8', 'Мазурка «Ностальгия» (Mazurka Nostalgia)', 491, NULL),
	(571, 'https://www.youtube.com/watch?v=ZuTXwkp14K0', 'Мазурка «Привет из Австрии» (Mazurka Saluti dall’Austria)', 492, NULL),
	(572, 'https://www.youtube.com/watch?v=DEU6gwITGtc', 'Мазурка «Сердце женщины» (Mazurka Cuore di Donna)', 493, NULL),
	(573, 'https://vk.com/video-56188966_169522571', 'Мазурка «Сицилийская вечерня» (Mazurka Vespri Siciliani, Мазурка «Сицилийский вечер»)', 494, NULL),
	(575, 'https://vk.com/video5618657_153619244', 'Мазурка «Тысяча цветов» (Mazurka Mille Fiori)', 495, NULL),
	(576, 'https://www.youtube.com/watch?v=9OkvJAYKn6w', 'Мазурка «Фата-моргана» (Mazurka Fata Morgana)', 496, NULL),
	(577, 'https://youtu.be/yXD4gfAuQAA?si=To7CEdEO2HhAssD7', 'Мазурка «Фру-фру» (Mazurka Frou-Frou)', 497, NULL),
	(578, 'https://youtu.be/O7xMELvdkc8?si=DQEa-NPmkCEMpvp2', 'Мазурка «Цветы в мае» (Mazurka Fiori di Maggio)', 498, NULL),
	(579, 'https://www.youtube.com/watch?v=IdPqO0mwfzI', 'Мазурка «Эмансипата» (Mazurka L’Emancipata)', 500, NULL),
	(580, 'https://vk.com/video-2272142_144891158', ' Мазурка в пять па (Мазурка в 5 па)', 501, NULL);
/*!40000 ALTER TABLE "Video" ENABLE KEYS */;

/*!40103 SET TIME_ZONE=IFNULL(@OLD_TIME_ZONE, 'system') */;
/*!40101 SET SQL_MODE=IFNULL(@OLD_SQL_MODE, '') */;
/*!40014 SET FOREIGN_KEY_CHECKS=IFNULL(@OLD_FOREIGN_KEY_CHECKS, 1) */;
/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40111 SET SQL_NOTES=IFNULL(@OLD_SQL_NOTES, 1) */;
